{"format": "keras", "nodes": [{"name": "input_1", "id": "input_1", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "sequential_1", "id": "sequential_1", "class_name": "Sequential", "output_shape": [224, 224, 3], "num_parameters": 0}, {"name": "sequential_2", "id": "sequential_2", "class_name": "Sequential", "output_shape": [224, 224, 3], "num_parameters": 0}, {"name": "conv2d", "id": "conv2d", "class_name": "Conv2D", "output_shape": [null, 222, 222, 6], "num_parameters": 168}, {"name": "batch_normalization", "id": "batch_normalization", "class_name": "BatchNormalization", "output_shape": [null, 222, 222, 6], "num_parameters": 24}, {"name": "max_pooling2d", "id": "max_pooling2d", "class_name": "MaxPooling2D", "output_shape": [null, 111, 111, 6], "num_parameters": 0}, {"name": "dropout", "id": "dropout", "class_name": "Dropout", "output_shape": [null, 111, 111, 6], "num_parameters": 0}, {"name": "conv2d_1", "id": "conv2d_1", "class_name": "Conv2D", "output_shape": [null, 109, 109, 6], "num_parameters": 330}, {"name": "batch_normalization_1", "id": "batch_normalization_1", "class_name": "BatchNormalization", "output_shape": [null, 109, 109, 6], "num_parameters": 24}, {"name": "max_pooling2d_1", "id": "max_pooling2d_1", "class_name": "MaxPooling2D", "output_shape": [null, 108, 108, 6], "num_parameters": 0}, {"name": "flatten", "id": "flatten", "class_name": "Flatten", "output_shape": [null, 69984], "num_parameters": 0}, {"name": "dense", "id": "dense", "class_name": "Dense", "output_shape": [null, 16], "num_parameters": 1119760}, {"name": "batch_normalization_2", "id": "batch_normalization_2", "class_name": "BatchNormalization", "output_shape": [null, 16], "num_parameters": 64}, {"name": "dropout_1", "id": "dropout_1", "class_name": "Dropout", "output_shape": [null, 16], "num_parameters": 0}, {"name": "dense_1", "id": "dense_1", "class_name": "Dense", "output_shape": [null, 64], "num_parameters": 1088}, {"name": "batch_normalization_3", "id": "batch_normalization_3", "class_name": "BatchNormalization", "output_shape": [null, 64], "num_parameters": 256}, {"name": "dense_2", "id": "dense_2", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 65}], "edges": [["input_1", "sequential_1"], ["input_1", "sequential_1"], ["input_1", "sequential_1"], ["input_1", "sequential_1"], ["input_1", "sequential_1"], ["sequential_1", "sequential_2"], ["sequential_1", "sequential_2"], ["sequential_1", "sequential_2"], ["sequential_1", "sequential_2"], ["sequential_1", "sequential_2"], ["sequential_2", "conv2d"], ["conv2d", "batch_normalization"], ["batch_normalization", "max_pooling2d"], ["max_pooling2d", "dropout"], ["dropout", "conv2d_1"], ["conv2d_1", "batch_normalization_1"], ["batch_normalization_1", "max_pooling2d_1"], ["max_pooling2d_1", "flatten"], ["flatten", "dense"], ["dense", "batch_normalization_2"], ["batch_normalization_2", "dropout_1"], ["dropout_1", "dense_1"], ["dense_1", "batch_normalization_3"], ["batch_normalization_3", "dense_2"]]}